Tekla Open API Reference for Tekla Structures 2025
LoftedPlate.LoftedPlateFaceTypeEnum Enumeration
 Lofted plate solid creation face types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoftedPlateFaceTypeEnum
Public Enumeration LoftedPlateFaceTypeEnum
Members
Member name | Value | Description
Perpendicular | 0 |  Faces are perpendicular to the thickness direction.
BoundedByCurvePlanes | 1 |  Faces following each curve plane.
See Also
Reference
Tekla.Structures.Model Namespace